Show / Hide Table of Contents
Class ConcreteSetupEc2
Concrete setup Ec2
Inheritance
System.Object
OpenObject
OpenElementId
ConcreteSetup
ConcreteSetupEc2
Inherited Members
 ConcreteSetup.SetupValues
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Concrete
Assembly: IdeaRS.OpenModel.dll
Syntax
public class ConcreteSetupEc2 : ConcreteSetup
Properties
Improve this Doc   View Source
Annex
Annex code
Declaration
public NationalAnnexCode Annex { get; set; }
Property Value
 Type |  Description
 NationalAnnexCode
Improve this Doc   View Source
Nad
Nad strategy
Declaration
public NadStrategyConcrete Nad { get; set; }
Property Value
 Type |  Description
 NadStrategyConcrete
 Improve this Doc
 View Source